Revit 2027 API
BuiltInFailures.MEPSupportFailures.InstanceProfileNotMatchWithHostError Property
 The [Symbol]'s profile does not match the host. Instances of [Symbol] will be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InstanceProfileNotMatchWithHostError { get; }
Public Shared ReadOnly Property InstanceProfileNotMatchWithHostError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InstanceProfileNotMatchWithHostError {
	FailureDefinitionId^ get ();
}
static member InstanceProfileNotMatchWithHostError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPSupportFailures Class
Autodesk.Revit.DB Namespace